website.org
#+TITLE: Personal Website
#+DATE: July 17, 2018
#+AUTHOR: Colin McLear

*** Research
:PROPERTIES:
:EXPORT_FILE_NAME: research
:EXPORT_HUGO_WEIGHT: -100
:EXPORT_HUGO_MENU: :menu main
:END:

I have broad interests in epistemology, metaphysics, the philosophy of mind, and
the foundations of cognitive science. I pursue these interests historically, by
querying the European philosophical tradition from the seventeenth through the
nineteenth centuries. I am particularly interested in German Idealism, and the
focus of my work thus far has been Immanuel Kant's philosophy, especially his
views on the nature of the mind and the forms of its manifestation, both
rational and non-rational, in animal life. I have written on Kant's views
concerning the mind, perception, his theory of human reason and rationality, and
the broader metaphysical and epistemological views with which these ideas are
integrated. I'm also very interested in seeing what, if any, connections may be
made between Kant's positions and contemporary research programs in the
philosophy of mind and metaphysics. In particular, I am interested in issues
pertaining to explanation, the study of mental content, the nature and
significance of self-consciousness, reasoning and rationality, and animal
cognition.

#+HTML:<div id="philpeople-component-follow_btn"></div> <script type="text/javascript" src="https://philpeople.org/components/follow_btn?props%5B%3Aprofile_id_prop%5D=740&amp;props%5Bcontext%5D=external"></script>

#+HTML:<style> .xpapers_abstract { font-size:smaller; padding-left:6px; padding-bottom:10px } .xpapers_pubtype {font-size:28px} .publication-title {font-weight:regular } .publication-cite { color : #444 } </style>

#+HTML: <script id='ppl-widget' type="text/javascript" src="https://philpeople.org/widget/colin-mclear.js?app=philpapers&amp;iframe=true"></script>

**** Work in Progress 

If you're interested in a draft of any of the following please [[mailto:mclear@unl.edu][email me]].

- Reason's Order: Kant on Rational Agency (book manuscript)
- Kant on Time and Receptivity
- Kant on Reason and Nature
- Hegel on the subjectivity of Kant's idealism

# - "Actuality and intuition"
# - "Reflection and reasoning"
# - "The unity of reflection"
# - "Definition and essence in the /Metaphysical Foundations of Natural Science/" 


**** Upcoming Conferences & Presentations 
- June 2022. "Kant on Control & Rationality.” Keynote speaker, Graduate Conference on Freedom, Action, and Control: Conceptions of Rational Agency in Kant and the European Enlightenment; University of Bucharest (online).
- May 2022. /Reason’s Order: Kant on the Conditions of Rational Agency/. Book workshop, University of Toronto. 
- October 2021. "Self-Consciousness & Rationality." Colloquium, Department of Philosophy, University of Wisconsin--Madison.
- October 2021. "Self-Consciousness & Rationality." Kantian Rationality Lab,
  Kaliningrad. 
- May 2021. "Self-Consciousness & Rationality." Conference on Kant on the Self, Princeton University. 
- February 2020. "On Pure Intuition and Actuality." /Central division of the American
  Philosophical Association/, Chicago IL.
- December 2019. "Rationality: What Difference Does It Make?" Boston Area Kant Colloquium, Boston, MA.
- June 2019. "Self-Consciousness and the Freedom of Thought." China Kant Society, Peking University.
  Beijing, China.
- February 2019. Author Meets Critics Session on Melissa Merritt, /Kant on
  Reflection and Virtue/. Meeting of the Central Division of the APA. Denver, CO.
- November 2018. "On the Freedom of the Intellect." University of Nebraska–Omaha. Omaha, NE. 
  
  

