content/research.md
+++
title = "Research"
draft = false
weight = -100
author = false
toc = false
[menu]
  [menu.main]
    weight = 3002
    identifier = "research"
+++

I have broad interests in epistemology, metaphysics, the philosophy of mind, and
the foundations of cognitive science. I pursue these interests historically, by
querying the European philosophical tradition from the seventeenth through the
nineteenth centuries. I am particularly interested in German Idealism, and the
focus of my work thus far has been Immanuel Kant&rsquo;s philosophy, especially his
views on the nature of the mind and the forms of its manifestation, both
rational and non-rational, in animal life. I have written on Kant&rsquo;s views
concerning the mind, perception, his theory of human reason and rationality, and
the broader metaphysical and epistemological views with which these ideas are
integrated. I&rsquo;m also very interested in seeing what, if any, connections may be
made between Kant&rsquo;s positions and contemporary research programs in the
philosophy of mind and metaphysics. In particular, I am interested in issues
pertaining to explanation, the study of mental content, the nature and
significance of self-consciousness, reasoning and rationality, and animal
cognition.

<div id="philpeople-component-follow_btn"></div> <script type="text/javascript" src="https://philpeople.org/components/follow_btn?props%5B%3Aprofile_id_prop%5D=740&amp;props%5Bcontext%5D=external"></script>

<style> .xpapers_abstract { font-size:smaller; padding-left:6px; padding-bottom:10px } .xpapers_pubtype {font-size:28px} .publication-title {font-weight:regular } .publication-cite { color : #444 } </style>

<script id='ppl-widget' type="text/javascript" src="https://philpeople.org/widget/colin-mclear.js?app=philpapers&amp;iframe=true"></script>


## Work in Progress {#work-in-progress}

If you&rsquo;re interested in a draft of any of the following please [email me](mailto:mclear@unl.edu).

-   Reason&rsquo;s Order: Kant on Rational Agency (book manuscript)
-   Kant on Time and Receptivity
-   Kant on Reason and Nature
-   Hegel on the subjectivity of Kant&rsquo;s idealism


## Upcoming Conferences &amp; Presentations {#upcoming-conferences-and-presentations}

-   June 2022. &ldquo;Kant on Control &amp; Rationality.” Keynote speaker, Graduate Conference on Freedom, Action, and Control: Conceptions of Rational Agency in Kant and the European Enlightenment; University of Bucharest (online).
-   May 2022. _Reason’s Order: Kant on the Conditions of Rational Agency_. Book workshop, University of Toronto.
-   October 2021. &ldquo;Self-Consciousness &amp; Rationality.&rdquo; Colloquium, Department of Philosophy, University of Wisconsin--Madison.
-   October 2021. &ldquo;Self-Consciousness &amp; Rationality.&rdquo; Kantian Rationality Lab,
    Kaliningrad.
-   May 2021. &ldquo;Self-Consciousness &amp; Rationality.&rdquo; Conference on Kant on the Self, Princeton University.
-   February 2020. &ldquo;On Pure Intuition and Actuality.&rdquo; _Central division of the American
    Philosophical Association_, Chicago IL.
-   December 2019. &ldquo;Rationality: What Difference Does It Make?&rdquo; Boston Area Kant Colloquium, Boston, MA.
-   June 2019. &ldquo;Self-Consciousness and the Freedom of Thought.&rdquo; China Kant Society, Peking University.
    Beijing, China.
-   February 2019. Author Meets Critics Session on Melissa Merritt, _Kant on
    Reflection and Virtue_. Meeting of the Central Division of the APA. Denver, CO.
-   November 2018. &ldquo;On the Freedom of the Intellect.&rdquo; University of Nebraska–Omaha. Omaha, NE.
